using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _12.PathFinding
{
    public class AStar
    {
        /************************************************************
         * A* 알고리즘
         * 
         * 다익스트라 알고리즘을 확장하여 만든 최단경로 탐색알고리즘
         * 경로 탐색의 우선순위를 두고 유망한 해부터 우선적으로 탐색
         ************************************************************/
        //다익스트라 : 방문하지 않은 정점 중 가장 가까운 정점 선택
        //     A*   : 방문하지 않은 정점 중 예상 가중치가 가장 가까운 정점 선택

        // A*와는 다르게 다익스트라의 경우는 전방향으로 탐색을 하기때문에
        // 불필요한 방향으로 과다하게 탐색을 하기 때문에 나온 알고리즘이다
        // A*는 좌표가 있기 때문에 우선적으로 탐색을 해야하는 방향을 지정할 수 있다

        
    }
}
